slides/HW2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HW2</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="HW2"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-05T23:58-0700"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">HW2</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 HW2 - Personal Site</a></li>
<li><a href="#sec-2">2 HTML</a></li>
<li><a href="#sec-3">3 CSS</a></li>
<li><a href="#sec-4">4 Testing</a></li>
<li><a href="#sec-5">5 Pull Request</a></li>
<li><a href="#sec-6">6 public_html</a></li>
<li><a href="#sec-7">7 Extra Credit</a>
<ul>
<li><a href="#sec-7-1">7.1 Motivation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> HW2 - Personal Site &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Write HTML for a personal page
</li>
<li>Write CSS to style it
</li>
<li>Test it (validate, browser test)
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> HTML &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Required elements:
<ul>
<li>html
</li>
<li>title
</li>
<li>head
</li>
<li>link
</li>
<li>body
</li>
<li>div
</li>
<li>a
</li>
<li>ul/ol
</li>
<li>li
</li>
<li>img
</li>
<li>p
</li>
<li>h1/h2/h3/h4
</li>
<li>&lt;!&ndash; comments &ndash;&gt;
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> CSS &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>More than 1 CSS file
</li>
<li>Styles that "cascade", ie some element whose style is affected by more
    than 1 declaration
</li>
<li>1 or more use of inline CSS
</li>
<li>Semantic use of <code>class</code>, <code>id</code> attributes
</li>
<li>/ * comments * /
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Testing &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>HTML validates in <a href="http://validator.w3.org/">http://validator.w3.org/</a>
</li>
<li>CSS validates in <a href="http://jigsaw.w3.org/css-validator/">http://jigsaw.w3.org/css-validator/</a>
</li>
<li>Warnings OK
</li>
<li>Test in two browsers
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Pull Request &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>Should have all the files
</li>
<li>In the description, include which browsers you tested with, including
    versions
</li>
<li>The URL to your page
</li>
</ul>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> public_html &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Make your page public
</li>
</ul>




<pre class="src src-html">cd ~/public_html
ln -s ../webarch2013/public_html webarch2013
</pre>

<ul>
<li><a href="http://people.ischool.berkeley.edu/~jblomo/webarch2013/">http://people.ischool.berkeley.edu/~jblomo/webarch2013/</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Extra Credit &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>Create an <i>additional</i> page with <a href="http://getbootstrap.com/">Bootstrap</a>
</li>
<li>Use at least 1 <a href="http://getbootstrap.com/components/">Component</a>
</li>
<li>Extra credit applies <b>up to</b> full credit on a particular assignment
</li>
</ul>


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Motivation &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>Main motivation is for those looking to become web developers, what can
     you do to set yourself appart?
</li>
<li>Will make up for mistakes in the main project
</li>
<li>Amount of extra credit given will depend on assignment, effort, and will
     be at instructor's discression
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-09-05T23:58-0700</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
